Repository: RKWKomZe/RkwResourcespace
Catalog: Resources/Private/Language/*.locallang.xlf
Languages: de

# tx_rkw_resourcespace_domain_model_import.description
source: Import images from "ResourceSpace" (rkwmedia.rkw.de) to TYPO3
de: Importiert Bilder vom "ResourceSpace" (rkwmedia.rkw.de) zu TYPO3

# tx_rkwresourcespace_domain_model_import.resource_space_image_id
source: ID of resource space image
de: ID des Bildes im ResourceSpace

# tx_rkwresourcespace_domain_model_import.resource_space_user_id
source: ID of resource space user
de: ID des ResourceSpace Nutzenden

# tx_rkwresourcespace_domain_model_import.resource_space_user_name
source: User name of resource space user
de: Name des ResourceSpace Nutzenden

# tx_rkwresourcespace_domain_model_import.resource_space_user_real_name
source: Real name of resource space user
de: Realer Name des ResourceSpace Nutzenden

# tx_rkwresourcespace_domain_model_import.file
source: File
de: Datei (Hier: Bild)

# tx_rkwresourcespace_domain_model_import.backend_user
source: Backend user
de: Backend Nutzende

# tx_rkwresourcespace_controller_import.invalidIp
source: Access denied. Invalid IP!
de: Anfrage abgelehnt. Ungültige IP!

# tx_rkwresourcespace_controller_import.noImageFound
source: No image found!
de: Ooops! Da ist etwas schiefgelaufen. Eine Datei mit dieser ID konnte im ResourceSpace nicht gefunden werden :-/

# tx_rkwresourcespace_helper_file.fileCopyFailed
source: File copy failed!
de: Ooops! Hier ist etwas schiefgelaufen. Das Bild konnte nicht kopiert werden. Es wurde eine gültige URL von der API übergeben, aber offenbar ist das Bild im ResourceSpace nicht mehr hinterlegt.

# tx_rkwresourcespace_helper_file.fileAlreadyExists
source: This file already exists!
de: Nach Abgleich der Bild-ID ist keine Aktion notwendig: Dieses Bild steht bereits im Medienpool-Ordner zur Verfügung :)

# tx_rkwresourcespace_helper_file.fileCreated
source: Success: File created!
de: Woohoo! Das Bild wurde erfolgreich übertragen. Bitte prüfen Sie vor der Verwendung des Bildes in TYPO3, ob die Urheberangaben korrekt übertragen wurden.

# tx_rkwresourcespace_helper_file.errorMisconfiguration
source: The RkwResourcespace Extension seems misconfigured. Show extension log for further information.
de: Ooops! Hier ist etwas schief gelaufen. Scheinbar hapert es an der Konfiguration, bitte kontaktieren Sie den zuständigen Support.

# tx_rkwresourcespace_helper_file.forbiddenFileExtension
source: This file extension is not allowed!
de: Ooops! Dieses Dateiformat ist nicht erlaubt. Nutzen Sie stattdessen z.B. das "jpg"-Format. Folgende Dateiendungen sind gesperrt: %s

# tx_rkwresourcespace_templates_new.backendLogin
source: You have to login in backend to use this service!
de: Hinweis: Backend Login erforderlich!

# tx_rkwresourcespace_partial_form_fields.placeholder
source: ResourceSpace Image ID
de: ResourceSpace Bild-ID hier eingeben

# tx_rkwresourcespace_partial_form_fields.import
source: Import
de: Importieren!
